Autodesk.Revit.DB.DimensionSegmentArray
An array that can contain any number of DimensionSegment objects.

Autodesk.Revit.DB.DimensionSegmentArray.Insert(Autodesk.Revit.DB.DimensionSegment,System.Int32)
System.Int32
Insert the specified item into the array.
item: The item to be inserted into the array.
index: The item will be inserted before this index.
Returns: Returns whether the item was inserted into the array.

Autodesk.Revit.DB.DimensionSegmentArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.DimensionSegmentArray.ReverseIterator
Autodesk.Revit.DB.DimensionSegmentArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.DimensionSegmentArray.ForwardIterator
Autodesk.Revit.DB.DimensionSegmentArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.DimensionSegmentArray.Append(Autodesk.Revit.DB.DimensionSegment)
void
Add the item to the end of the array.
item: The item to be added.

Autodesk.Revit.DB.DimensionSegmentArray.Clear
void
Removes every item from the array, rendering it empty.

Autodesk.Revit.DB.DimensionSegmentArray.Size
System.Int32
get
Returns the number of objects that are in the array.

Autodesk.Revit.DB.DimensionSegmentArray.Item(System.Int32)
System.Object
Gets or sets an item at a specified index within the array.
index: The index of the item to be set or retrieved.
Returns: Returns the object at the specified index.

Autodesk.Revit.DB.DimensionSegmentArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.